Revit 2027 API
PanelScheduleSheetInstance.ScheduleId Property
 The panel schedule id.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ScheduleId { get; set; }
Public Property ScheduleId As ElementId
	Get
	Set
public:
property ElementId^ ScheduleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ScheduleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace